package com.yunfang.eias.enumObj;

/**
 * 任务列表中存在的菜单项
 * 
 * @author gorson
 * 
 */
public enum TaskMenuEnum {
	/**
	 * 领取任务
	 */
	领取任务,
/*	*//**
	 * 领取任务并编辑
	 *//*
	领取任务并编辑,*/
	/**
	 * 查看任务信息
	 */
	查看任务信息,
	/**
	 * 提交选中任务
	 */
	提交选中任务,
	/**
	 * 重新提交选中任务
	 */
	重新提交选中任务,
	/**
	 * 编辑内容
	 */
	编辑内容,
	/***/
	同步服务器数据,
	/**
	 * 收费信息
	 */
	收费信息,
	/**
	 * 暂停任务
	 */
	暂停任务,
	/***
	 * 添加任务备注
	 */
	任务备注,
	/**
	 * 复制
	 */
	复制,
	/**
	 * 粘贴
	 */
	粘贴,
	/**
	 * 粘贴创建新任务
	 */
	粘贴创建新任务,
	/**
	 * 删除本地任务
	 */
	删除本地任务,
	/** 删除已选中本地任务 */
	删除已选中本地任务,
	/**
	 * 提交本地任务
	 */
	提交本地任务,
	/**
	 * 重新提交本地任务
	 */
	重新提交本地任务,
	/**
	 * 任务匹配
	 */
	任务匹配,
	/**
	 * 取消提交任务
	 */
	取消提交任务,
	/**
	 * 数据检查
	 */
	数据检查并导出,
	/**
	 * 任务数据导入
	 */
	任务数据导入,
	/**
	 * 图片补发
	 */
	图片补发,
	/**
	 * 预约信息
	 */
	预约信息,
	/**
	 * 只显示完成报告任务
	 */
	只显示完成报告任务,
	/**
	 * 显示全部完成任务
	 */
	显示全部完成任务,
	/**
	 * 删除选中任务资源文件
	 */
	删除选中任务资源文件,
	/**启用已暂停的任务*/
	启用任务
}
